@extends('layouts.app')


@section('title')
    خانه | هویج هام
@endsection


@section('keywords')
    <meta name="keywords" content="هویج هام, برنامه نویسی, خانه, صفحه اصلی">
@endsection



@section('content')


    <h1>Index page</h1>

<?php echo nl2br(
"    من کی هستم؟
    چیه این هویج هام؟
    چرا هویج هام؟
    راهنمای هویج هام
    پولیه؟
    قوانین و 
    
    
    ـ من کی هستم؟
    سلام من صادق ایپکی جو هستم دانشجوی رشته کامپیوتر دانشگاه بوعلی سینا. 
    
    ـ هویج هام چی هستش؟
    هویج هام یک وبسایته که در‌واقع یک وبلاگه ولی خب خیلی شبیه وبسایته، بگذریم... ماجرا پیاده‌سازی هویج هام از اون جا شروع شد که ترم زوج دانشگاه تموم شد و وارد تابستان شدیم من هم حساب کردم با خودم دیدم تابستان سه ماهه!!! اولش جا خوردم ولی بعد به خودم آمدم و تصمیم گرفتم حداقل یکی دو تا کار کوچیک انجام بدم تا اول پاییز همون یکی دوتا کار رو واسه شمردن داشته باشم. از طرفی بدم نمی‌آمد یه وبلاگ داشته باشم که اگر یه موقع تو حوزه برنامه نویسی و درکل علوم کامپیوتر، کاری کردم، پروژه ای انجام دادم، مطلبی رو یاد گرفتم و یا تجربه‌ای کسب کردم اون رو تو وبلاگم با بقیه به اشتراک بگذارم. پس تصمیم گرفتم این وبلاگ رو پیاده‌سازی کنم. کمی که کار جلو رفت با خودم گفتم چرا بقیه نتونن این کار رو بکنن؟ یعنی هر کی دلش خواست بتونه وارد سایت بشه و مطالبی رو که دوست داره رو در فضایی آرام و دلنشین با بقیه به اشتراک بگذاره، و تصمیم گرفتم این گزینه رو هم به اون اضافه کنم و این کار رو کردم. پس چی شد؟؟ هویج هام یک وبگاه برای به اشتراک گذاشتن تجربیات برنامه نویس ها و علاقمندان این مسیر هستش و البته ورود برای همه آزاد است.
    
    ـ چرا هویج هام؟
    هویج هام چیزی هستش معادل: کار هام (کارهای من) ، پست هام، پروژه هام و … ولی هیچ کدام از این‌ها به اندازه هویج هام مسخره و خاص نیستند. پس تصمیم گرفتم این وبگاه رو هویج هام بنامم.
    
    
    ـ راهنمای هویج هام
    نسخه‌ای که هم‌اکنون در حال استفاده از آن هستید نسخه z1 معادل نسخه 00.01 هویج هام هستش. این نسخه شامل امکانات ابتدایی و البته کل پروژه در مرحله آزمایش قرار داره (البته کار های من امتحان خودشون رو پس دادن به جز این یکی). تو این نسخه شما می‌توانید بدون عضویت به تمام مطالب دسترسی داشته باشید. ولی اگه بخواهید خودتون هویجی به هویج ها اضافه کنید باید عضو بشید. با عضویت، شما می‌توانید پست های خودتون رو بنویسید، به پست های دیگران نظر بدهید و اگر از پستی خوشتون اومد می‌توانید اون رو انتخاب کنید تا در پنلی که مخصوص شماست نگهداری بشه که بعداً بهش برگردید و مطالعه اش کنید. راستش در حال حاضر هویج هام فقط همین امکانات رو داره و همانطور که قبلاً گفتم این نسخه شامل ابتدایی ترین و پایه‌ای ترین گزینه هاست. و نکته آخر در مورد بخش اعضا هستش. پس از عضویت شما می‌توانید یک عکس برای پروفایل خودتون انتخاب کنید و همچنین کمی در مورد خودتون توضیح بدین (بخش درباره من). در بخش اعضا می‌توانید تمام کسانی که عضو هویج هام شده‌اند رو ببینید اون ها رو بیشتر بشناسید و پست هاشون رو بخوانید همین.
    
    
    ـ پولیه؟
    نه خیر ـ در این وبگاه خدمت خاصی ارایه نمیشه پس پولی هم بابت چیزی پرداخت نمی‌کنید. البته یه درگاه زرین پال قرار میدم که اگه کسی دوست داشت می تونه تو هزینه‌ها به ما کمک کنه.
    
"); ?>

@endsection